Config/Catalogs/Services.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Services</Name>
			<Comment>Услуги</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DescriptionTranslations</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GroupByDescriptionTranslations</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Unit</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UnitTranslations</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GetUnitFromRule</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllowChangePrice</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RecalculatePriceWhenSumChanged</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QuantityCalculationRule</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QuantityCalculationRules</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsRoomRevenue</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomRevenueAmountsOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsInPrice</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsResourceRevenue</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotGroupIntoRoomRateOnPrint</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SplitToSeparateSettlements</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotExportToTheAccountingSystem</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsNotInvoiced</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BreakdownListFormula</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BreakdownListFormulas</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServiceRegistrationIsTurnedOn</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MaxOneServicePerDayIsAllowed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServiceType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ServiceTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentSection</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentSections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TaxationSystem</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TaxationSystems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargePerPerson</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsStockArticle</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsAgentService</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Principal</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PrincipalType</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsNotOurService</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsHotelProductService</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsPricePerMinute</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ResourceType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ResourceTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Resource</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Resources</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BoundService</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChequeItemType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ChequeItemTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Composition</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HideIntoServiceOnPrint</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsGiftCertificate</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BonusPaymentsNotAllowed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BarCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsResortFee</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AvailableQuantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DepartmentCode</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DepartmentCodes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrectionService</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NoPrepaymentIsAllowed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashRegisterItemCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeToEachGuestSeparately</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AlwaysChargeInAdvance</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsQuantitativeAccounting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InvoiceGroupingName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseMarking</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpgradeFromTerms</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpgradeToTerms</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExciseDutyType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExciseDutyTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Volume</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OnlineAvaliable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MarkingCodeType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.MarkingCodeTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeOnCreditIsAllowed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ServiceItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ServiceItem</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ServiceItems</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Output</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Unit</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Sum</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ReplacementIndex</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CostPrice</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CostSum</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/Services/Ext/ManagerModule.bsl
#Region EventHandlers

// --------------------------------------------------------------------------------
Procedure ChoiceDataGetProcessing(pChoiceData, pParameters, pStandardProcessing)
	If Not pParameters.Filter.Property("Hotel") Then
		vHotelFilter = New Array;
		vHotelFilter.Add(SessionParameters.CurrentHotel);
		vHotelFilter.Add(Catalogs.Hotels.EmptyRef());
		
		pParameters.Filter.Insert("Hotel", vHotelFilter);
	EndIf;
EndProcedure

#EndRegion

#Region Public

// --------------------------------------------------------------------------------
//
// Parameters:
//  pData			 - CatalogRef	 - Ref
//  pReceiverNode	 - ExchangePlanRef	 - The Receiver node
//
Procedure ExchangePlansRecordChanges(pData, pReceiverNode = Undefined) Export
	ExchangePlansProcessing.ExchangePlansRecordChanges(pData, pData.Hotel, pReceiverNode);
EndProcedure // ExchangePlansRecordChanges

// -----------------------------------------------------------------------------
//
// Parameters:
//  pRef					 - CatalogRef.Services	 - Ref
//  pLang					 - CatalogRef.Languages	 - Ref
//  pUseGroupByDescription	 - Boolean				 - UseGroupByDescription
// 
// Returns:
//  String - service description
//
Function pmGetServiceDescription(pRef, pLang, pUseGroupByDescription = False) Export
	vDescr = "";
	If Not ValueIsFilled(pLang) Then
		vDescr = TrimAll(pRef.Description);
	Else
		If pUseGroupByDescription And Not IsBlankString(pRef.GroupByDescriptionTranslations) Then
			vDescr = TrimAll(cmNStr(pRef.GroupByDescriptionTranslations, pLang));
		Else
			If IsBlankString(pRef.DescriptionTranslations) Then
				vDescr = TrimAll(pRef.Description);
			Else
				vDescr = TrimAll(cmNStr(pRef.DescriptionTranslations, pLang));
			EndIf;
		EndIf;
	EndIf;
	Return vDescr;
EndFunction // pmGetServiceDescription      

// -----------------------------------------------------------------------------
//
// Parameters:
//  pRef	 - CatalogRef.Services	 - Ref
//  pLang	 - CatalogRef.Languages	 - Ref
// 
// Returns:
//  String - Unit description
//
Function pmGetServiceUnitDescription(pRef, pLang) Export
	vDescr = "";
	If Not ValueIsFilled(pLang) Then
		vDescr = TrimAll(pRef.Unit);
	Else
		If IsBlankString(pRef.UnitTranslations) Then
			vDescr = TrimAll(pRef.Unit);
		Else
			vDescr = TrimAll(cmNStr(pRef.UnitTranslations, pLang));
		EndIf;
	EndIf;
	Return vDescr;
EndFunction // pmGetServiceUnitDescription

// -----------------------------------------------------------------------------
//
// Parameters:
//  pRef		 - CatalogRef.Services	 - Ref
//  pQuantity	 - Number				 - Quantity
//  pLang		 - CatalogRef.Languages	 - Ref
// 
// Returns:
//  String - Formated string
//
Function pmGetServiceQuantityPresentation(pRef, pQuantity, pLang) Export
	vQuantityStr = "";   
	vOneMinute = 60;  
	v24Hour = 24;
	If Round(pQuantity, 3) <> pQuantity Then
		vQuantityStr = ?(pQuantity = 0, "", Format(pQuantity, "ND=17; NFD=3"));
	Else
		vQuantityStr = ?(pQuantity = 0, "", String(pQuantity));
	EndIf;
	vQuantityStr = TrimAll(vQuantityStr + " " + pmGetServiceUnitDescription(pRef, pLang));
	If pRef.GetUnitFromRule And ValueIsFilled(pRef.QuantityCalculationRule) Then
		If pRef.QuantityCalculationRule.PeriodInHours = v24Hour Then
			vQuantityInHours = Round(pQuantity * pRef.QuantityCalculationRule.PeriodInHours);
			vQuantityInDays = Int(vQuantityInHours / v24Hour);
			vQuantityInHours = vQuantityInHours - vQuantityInDays * v24Hour;
			If vQuantityInDays <> 0 Then
				vQuantityStr = String(vQuantityInDays) + " " + pmGetServiceUnitDescription(pRef, pLang) + " ";
			Else
				vQuantityStr = "";
			EndIf;
			If vQuantityInHours <> 0 Then
				vQuantityStr = vQuantityStr + String(vQuantityInHours) + cmNStr("en = ' h'; de = ' st'; ru = ' ч'", pLang);
			EndIf;
		EndIf;
	ElsIf pRef.IsResourceRevenue And Not pRef.RoomRevenueAmountsOnly Then
		If pRef.IsPricePerMinute And TrimAll(pRef.Unit) = TrimAll(Catalogs.Units.Minute) Then
			vQuantityStr = String(pQuantity) + cmNStr("en = ' m'; de = ' m'; ru = ' м'", pLang);
		ElsIf TrimAll(pRef.Unit) = TrimAll(Catalogs.Units.Hour) Then
			vQuantityInHours = Int(pQuantity);
			vQuantityInMinutes = Round((pQuantity - Int(pQuantity)) * vOneMinute, 0);
			If vQuantityInHours <> 0 Then
				vQuantityStr = String(vQuantityInHours) + cmNStr("en = ' h'; de = ' st'; ru = ' ч'", pLang) + " ";
			Else
				vQuantityStr = "";
			EndIf;
			If vQuantityInMinutes <> 0 Then
				vQuantityStr = vQuantityStr + String(vQuantityInMinutes) + cmNStr("en = ' m'; de = ' m'; ru = ' м'", pLang);
			EndIf;
		EndIf;
	EndIf;
	Return vQuantityStr;
EndFunction // pmGetServiceQuantityPresentation	

// -----------------------------------------------------------------------------
//  Get service characteristics
//
// Parameters:
//  pRef - CatalogRef.Services	 - Ref
// 
// Returns:
//  ValueTable - List service characteristics
//
Function pmGetServiceCharacteristics(pRef) Export
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT
	|	ServiceCharacteristics.Service AS Service,
	|	ServiceCharacteristics.ServiceCharacteristic AS ServiceCharacteristic,
	|	ServiceCharacteristics.ServiceCharacteristicValue AS ServiceCharacteristicValue
	|FROM
	|	InformationRegister.ServiceCharacteristics AS ServiceCharacteristics
	|WHERE
	|	ServiceCharacteristics.Service = &qService
	|	AND ServiceCharacteristics.ServiceCharacteristic.DeletionMark = FALSE
	|
	|ORDER BY
	|	ServiceCharacteristics.ServiceCharacteristic.Code";
	vQry.SetParameter("qService", pRef);
	vChars = vQry.Execute().Unload();
	Return vChars;
EndFunction // pmGetServiceCharacteristics      

// -----------------------------------------------------------------------------
//  Get service characteristic value
//
// Parameters:
//  pRef					 - CatalogRef.Services										 - Ref
//  pServiceCharacteristic	 - ChartOfCharacteristicTypesRef.ServiceCharacteristicTypes	 - Ref
// 
// Returns:
//  Characteristic.ServiceCharacteristicTypes - Service characteristic value
//
Function pmGetServiceCharacteristicValue(pRef, pServiceCharacteristic) Export
	vCharValue = Undefined;
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT
	|	ServiceCharacteristics.ServiceCharacteristicValue AS ServiceCharacteristicValue
	|FROM
	|	InformationRegister.ServiceCharacteristics AS ServiceCharacteristics
	|WHERE
	|	ServiceCharacteristics.Service = &qService
	|	AND ServiceCharacteristics.ServiceCharacteristic = &qServiceCharacteristic
	|
	|ORDER BY
	|	ServiceCharacteristics.ServiceCharacteristic.Code";
	vQry.SetParameter("qService", pRef);
	vQry.SetParameter("qServiceCharacteristic", pServiceCharacteristic);
	vChars = vQry.Execute().Select();
	While vChars.Next() Do
		vCharValue = vChars.ServiceCharacteristicValue;
		Break;
	EndDo;
	Return vCharValue;
EndFunction // pmGetServiceCharacteristicValue  

// -----------------------------------------------------------------------------
//
// Parameters:
//  pRef						 - CatalogRef.Services						 - Ref
//  pServiceCharacteristic		 - 											 - ChartOfCharacteristicTypesRef.ServiceCharacteristicTypes
//  pServiceCharacteristicValue	 - Characteristic.ServiceCharacteristicTypes - Value
//
Procedure pmSaveServiceCharacteristicValue(pRef, pServiceCharacteristic, pServiceCharacteristicValue) Export
	vServiceCharsMgr = InformationRegisters.ServiceCharacteristics.CreateRecordManager();
	vServiceCharsMgr.Service = pRef;
	vServiceCharsMgr.ServiceCharacteristic = pServiceCharacteristic;
	vServiceCharsMgr.Read();
	If vServiceCharsMgr.Selected() Then
		vServiceCharsMgr.Service = pRef;
		vServiceCharsMgr.ServiceCharacteristic = pServiceCharacteristic;
		vServiceCharsMgr.ServiceCharacteristicValue = pServiceCharacteristicValue;
		vServiceCharsMgr.Write();
	EndIf;
EndProcedure // pmSaveServiceCharacteristicValue

#EndRegion
